shoeproject-backend/app/controllers/shoes_controller.rb

  def index
    shoes = Shoe.where(user_id: params[:user_id])
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."user_id" = $1  [["user_id", 1]]

  def create
    shoe = Shoe.create(shoe_params)
---
INSERT INTO "shoes" ("style", "color", "user_id", "name", "size", "heel_height") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["style", "stiletto"], ["color", "#000000"], ["user_id", 4], ["name", "try again"], ["size", "8"], ["heel_height", "2.5"]]

  def destroy
    shoe = Shoe.find(params[:id])
    shoe.destroy
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "shoes" WHERE "shoes"."id" = $1  [["id", 11]]