shoeproject-backend/app/controllers/shoes_controller.rb

SELECT "shoes".* FROM "shoes"
---
  def index
    shoes = Shoe.all