shoeproject-backend/app/controllers/users_controller.rb

  def create
    #make a new user card
    user = User.create(user_params)
---
INSERT INTO "users" ("name", "image_url") VALUES ($1, $2) RETURNING "id"  [["name", "maddie"], ["image_url", "https://pbs.twimg.com/profile_images/1210618202457292802/lt9KD2lt.jpg"]]